Autodesk.Revit.DB.DirectShape.IsValidGeometry(Autodesk.Revit.DB.Solid)
Validate geometry to be stored in a DirectShape. Suitable geometry validation is performed. Additionally, the geometry
must make sense as a shape representation for the category assigned to this DirectShape object.
Geom:
Geometry object to be validated
Returns:
True if the supplied geometry object passes the validation criteria
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.IsValidTypeId(Autodesk.Revit.DB.ElementId)
Test the type id to make sure it satisfies the following conditions
- It is a valid element id
- It corresponds to a valid DirectShapeType
- The DirectShapeType has the same category assigned.
Additionally, this functions tests that the current type id in this DirectShape is invalid.
The type id is initialized to invalidElementId by the create functions. Once it is set, it may no longer be changed.
typeId:
Type id to be tested
Returns:
False unless typeId satisfies the conditions listed above and the type id of this object was not set previously.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.IsValidCategoryId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Test the category id to make sure it is indeed a top-level built-in category
categoryId:
Category id to be tested
doc:
Document to look up the category by id
Returns:
False unless categoryId corresponds to a valid built-in top-level category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.SetShape(System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
sets the view-specific Shape of this object to the supplied collection of Geometry objects. The objects are copied.
pGeomArr:
Shape of this object expressed as a collection of Geometry objects
viewType:
Optional: set a view-specific shape representation that will be used in views of that type only.
Passing DirectShapeTargetViewType::Default as view type will cause the default shape to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DirectShape.SetShape(System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject})
sets the Shape of this object to the supplied collection of Geometry objects. The objects are copied.
pGeomArr:
Shape of this object expressed as a collection of Geometry objects
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.SetTypeId(Autodesk.Revit.DB.ElementId)
Sets the DirectShapeType for the DirectShape element
typeId:
The ID of the type corresponding to this DirectShape element. May only be set once.
Throws Autodesk.Revit.Exceptions.ArgumentException:
typeId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.CreateElementInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.String,Autodesk.Revit.DB.Transform,System.String,System.String)
Create a DirectShape object and add it to document.
The shape stored in the element is either a reference or a copy of a definition shape
that was created earlier. How the definitions are stored will determine whether an instance or a copy of the
shape will be created. See DirectShapeLibrary for more details.
This function is included for convenience. It essentially combines CreateGeometryInstance and CreateElement.
Remarks:
This is intended to support a definition/instance pattern
common in CAD formats - DWG blocks, STEP MAPPED_ITEM, IFC IfcMappedItem.
Use DirectShapeLibrary class to store definitions prior to using them here.
document:
Document to which the created element will be added
typeId:
Element id of a DirectShapeType element.
categoryId:
Id of the category assigned to this DirectShape. Must be a valid category id.
definition_id:
ID of the shape definition that was created earlier and stored via DirectShapeLibrary
trf:
Transform to be applied to the definition
appGUID:
Identifies the creating application. May not be empty.
appDataGUID:
Optional, to be used by the creating application. The intended use is
to identify the native data that was the source of this DirectShape.
Returns:
DirectShape object if created successfully, NULL otherwise
Throws Autodesk.Revit.Exceptions.ArgumentException:
Element id categoryId does not correspond to a top-level built-in category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.CreateGeometryInstance(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Transform)
Create a copy of a definition shape that was created earlier.
Use DirectShapeLibrary class to store definitions prior to using them here.
How the definitions are stored will determine whether an instance or a copy of the
shape will be created. See DirectShapeLibrary for more details.
Use the output of this function as input to CreateElement to make the created shape persistent.
Remarks:
This is intended to support a definition/instance pattern
common in CAD formats - DWG blocks, STEP MAPPED_ITEM, IFC IfcMappedItem.
document:
Document to which the created element will be added
definition_id:
ID of the shape definition that was created earlier and stored via DirectShapeLibrary
trf:
Transform to be applied to the definition
Returns:
A collection of geometry objects representing a placed instance of the pre-defined shape
The caller function takes ownership
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShape.CreateElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,System.String)
Create a DirectShape object and add it to document.
document:
Document to which the created element will be added
categoryId:
Id of the category assigned to this DirectShape. Must be a valid category id.
appGUID:
Identifies the creating application. May not be empty.
appDataGUID:
Optional, to be used by the creating application. The intended use is
to identify the native data that was the source of this DirectShape.
Returns:
DirectShape object if created successfully, NULL otherwise
Throws Autodesk.Revit.Exceptions.ArgumentException:
Element id categoryId does not correspond to a top-level built-in category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015